#include "student.h"
#include <stdlib.h>
#include <stdio.h>
 
 void menu();
 
 //学生信息链表
 student_info* student_list;
 
 //用户可以选择1-7可以分别进行学生信息的查看、添加、删除，修改，计算平均成绩，保存，退出系统操作。
 int main()
 {
     int choice;
     int num;
     printf("*****************************************************************************************************************************\n");
     printf("****************************** 欢迎使用学生信息管理系统**********************************************************************\n");
     printf("*****************************************************************************************************************************\n");
     printf("-----------------------------------------------------------------------------------------------------------------------------\n");
     init_student_info_list();
     if(read_file())
         printf("从文件中读取学生信息成功.\n");
     else
         printf("从文字中读取学生信息失败.\n");
     printf("-----------------------------\n");
     menu();
     while(1)
     {
         printf("请选择操作: ");
         scanf("%d",&choice);
         switch(choice)
         {
         case 1:
             if(student_list_empty())
                 printf("学生信息表为空，请先添加学生信息.\n");
             else
                 display_student_info();
             break;
         case 2:
             if(add_student_info())
                 printf("添加学生信息成功.\n");
             else
                 printf("添加学生信息失败.\n");
             break;
         case 3:
             if(student_list_empty())
                 printf("学生信息表为空，请先添加学生信息.\n");
             else
             {
                 printf("请输入要删除学生信息的学号: ");
                 scanf("%d",&num);
                 if(delete_student_info(num))
                     printf("成功删除该学号对应的学生信息.\n");
                 else
                     printf("删除失败.\n");
             }
             break;
         case 4:
             if(student_list_empty())
                 printf("学生信息表为空，请先添加学生信息.\n");
             else
             {
                 printf("请输入要修改学生信息的学号: ");
                 scanf("%d",&num);
                 if(modify_student_info(num))
                     printf("成功修改该学号对应的学生信息.\n");
                 else
                     printf("修改失败.\n");
             }
             break;
         case 5:
             if(student_list_empty())
                 printf("学生信息表为空，请先添加学生信息.\n");
             else
                 display_average();
             break;
         case 6:
             if(student_list_empty())
                 printf("学生信息表为空，请先添加学生信息.\n");
             else
                 if(save_file())
                     printf("保存学生信息成功.\n");
                 else
                     printf("保存学生信息失败.\n");
             break;
         case 0:
             printf("欢迎下次使用,再见.\n");
	     printf("----------------------------------------------------------------------------------------------------");
             system("PAUSE");
             exit(0);
             break;
         default:
             printf("输入错误，请重新选择操作.\n");
         }
     }
     system("PAUSE");
     return 0;
 }
 
 void menu()
 {
     printf("------------------------- 1.查看学生信息.-------------------------------------------                                   \n");
     printf("------------------------- 2.添加学生信息.-------------------------------------------                                   \n");
     printf("------------------------- 3.删除学生信息.-------------------------------------------                                   \n");
     printf("--------------------------4.修改学生信息.-------------------------------------------                                   \n");
     printf("--------------------------5.输出平均成绩.-------------------------------------------                                   \n");
     printf("--------------------------6.保存学生信息.-------------------------------------------                                   \n");
     printf("--------------------------0.退出系统操作.-------------------------------------------                                   \n");
 }
